login-request.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
    xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
    xmlns:urn='urn:partner.soap.sforce.com'>
    <soapenv:Body>
        <urn:login>
            <urn:username><![CDATA[{username}]]></urn:username>
            <urn:password><![CDATA[{password}{security_token}]]></urn:password>
        </urn:login>
    </soapenv:Body>
</soapenv:Envelope>